print('Задача 2. Грубая математика')

# В одном аналитическом центре,
# где занимаются разного рода математическим анализом,
# работал практикант,
# который написал программу для расчёта некоторых функций.
# Правда, он в тот день очень устал
# и немного не так прочитал техническое задание 
# и функции теперь рассчитываются довольно грубо.
# 
# Вводится последовательность из N вещественных чисел.
# При этом положительные числа округляются вверх, отрицательные округляются вниз.
# 
# Напишите программу,
# которая выводит натуральный логарифм от числа,
# если оно положительное, и экспоненту в степени числа, если оно отрицательное.
# 
# Пример:
# 
# Введите кол-во чисел: 3
# Введите число: 1.3
# x = 2   log(x) = 0.6931471805599453
# 
# Введите число: -2.1
# x = -3   exp(x) = 0.049787068367863944
# 
# Введите число: -5.9
# x = -6   exp(x) = 0.0024787521766663585

import math
counter = int(input('How much number you want to input: '))
for i in range(counter):
	x = float(input('Input number: '))

	if x < 0:
		floor_x = math.floor(x)
		exp_x = math.exp(floor_x)
		print('x = ', floor_x, 'exp(x) = ', exp_x)
	
	elif x > 0:
		ceil_x = math.ceil(x)
		log_x = math.log(ceil_x)
		print('x = ',ceil_x, 'log(x) = ', log_x )